app/controllers/articles_controller.rb

  def create
    @article = Article.new article_params
    if @article.save
---
INSERT INTO "articles" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "tádfasdf"], ["content", "asdfasdf"], ["created_at", 2016-12-29 23:39:31 UTC], ["updated_at", 2016-12-29 23:39:31 UTC]]

  def load_article
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]