app/controllers/comments_controller.rb

  def create
    @comment = @commentable.comments.new comment_params
    if @comment.save
---
INSERT INTO "comments" ("content", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sadfasdf"], ["commentable_id", 2], ["commentable_type", "Article"], ["created_at", 2016-12-29 23:42:59 UTC], ["updated_at", 2016-12-29 23:42:59 UTC]]